Revit 2027 API
AnnotationFamilyUtils.SetIsExcludedFromLeaderOutline Method
 Sets if the element is excluded from the annotation outline used by leaders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetIsExcludedFromLeaderOutline(
	Element element,
	bool isExcluded
)
Public Shared Sub SetIsExcludedFromLeaderOutline (
	element As Element,
	isExcluded As Boolean
)
public:
static void SetIsExcludedFromLeaderOutline(
	Element^ element,
	bool isExcluded
)
static member SetIsExcludedFromLeaderOutline :
        element : Element *
        isExcluded : bool -> unit
Parameters
element Element
 The element to set.
isExcluded Boolean
 Pass true to exclude the element from the leader outline, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  element doesn't support the EXCLUDE_FROM_LEADER_OUTLINE parameter.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function controls the built-in parameter EXCLUDE_FROM_LEADER_OUTLINE.
See Also
Reference
AnnotationFamilyUtils Class
Autodesk.Revit.DB Namespace